app/Controllers/Denuncia.php


            $db->transCommit();
            $log['detalhes'] = json_encode(['status' => 'sucesso']);
            $logAuditoriaModel->insert($log);
---
INSERT INTO "log_auditoria" ("user_action", "user_email", "user_ip", "user_uuid", "user_nome_completo", "tipo_usuario", "detalhes") VALUES ('cadastrar-denuncia', 'cidadao@generico2.com.br', '::1', 'fa3e69d5-9e44-431a-a411-17f63fc9bc27', 'CIDADAO GENERICO 2', 'cidadao', '{"status":"sucesso"}')


        $array4json = array();
        $array4json['draw'] = $vars['draw'];
        $array4json['recordsTotal'] = $denunciaModel->builder()->where('id_orgao_responsavel_fk', $vars['id_orgao'])->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "denuncias"
WHERE "id_orgao_responsavel_fk" = 1