app/Controllers/Login.php

INSERT INTO "log_auditoria" ("user_action", "user_email", "user_ip", "user_uuid", "user_nome_completo", "tipo_usuario", "detalhes") VALUES ('logout', 'joao@pmpg.gov.br', '::1', 'c3ebc379-2ddc-4c86-a802-a41697367fde', 'JOAO PEDRO SANTOS SOUZA', 'orgao_representante', '{"status":"sucesso"}')
---
    public function logout() {
        $logAuditoriaModel = new LogAuditoriaModel();
        $log = [
            'user_action'        => 'logout',
            'user_email'         => session('email'),
            'user_ip'            => $this->request->getIPAddress(),
            'user_uuid'          => session('uuid'),
            'user_nome_completo' => session('nome_completo'),
            'id_orgao'           => session('id_orgao'),
            'tipo_usuario'       => session('tipo_usuario'),
        ];
        $log['detalhes'] = json_encode(['status' => 'sucesso']);
        $logAuditoriaModel->insert($log);