app/Controllers/Usuario.php


        $array4json = array();
        $array4json['draw'] = $vars['draw'];
        $array4json['recordsTotal'] = $usuarioModel->builder()->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "usuarios"

    public function exibir_perfil($uuid) {

        if ($uuid !== session()->get('uuid')) {
            return redirect()->to('/usuario/perfil/' . $uuid);
        }

        $db = \Config\Database::connect();
        $builder = $db->table('usuarios');

        $usuarioExistente = null;
        # Recupera o e-mail do usuário com base no ID
        $usuarioExistente = $builder
            ->select('id_usuario, user_uuid, nome_completo, email, senha, tipo_usuario, id_orgao_fk, ativo, data_criacao, data_edicao')
            ->where('user_uuid', $uuid)
            ->get()
            ->getRowArray();
---
SELECT "id_usuario", "user_uuid", "nome_completo", "email", "senha", "tipo_usuario", "id_orgao_fk", "ativo", "data_criacao", "data_edicao"
FROM "usuarios"
WHERE "user_uuid" = 'a3686810-a437-45cd-9fc8-25dc256e8d39'