app/Models/DenunciaModel.php

INSERT INTO "denuncias" ("titulo_denuncia", "id_tipo_fk", "detalhes", "logradouro", "numero", "bairro", "cep", "ponto_referencia", "status_denuncia", "id_usuario_fk") VALUES ('SDJASUDABWJKND', 8, 'sdihawuhd9owidaw', 'DASHIDAH', '1234', 'CENTRO', '84010-280', 'AJIDSIJDA', 'Pendente', '11')
---
    public function denunciaUpsert($data, $id = null) {
        try {
            $builder = $this->db->table($this->table);

            if (!empty($id)) {
                # Atualiza se o ID foi passado como parâmetro
                $builder->where('id_denuncia', $id);
                $success = $builder->update($data);

                return $success ? $id : false;
            }

            # Insere um novo registro se o ID não foi fornecido
            $success = $builder->insert($data);