app/Models/MidiaDenunciaModel.php

    public function inserirMidia($data) {
        $regID = $this->insert($data);
---
INSERT INTO "midia_denuncia" ("id_denuncia_fk", "tipo_midia", "caminho_arquivo") VALUES (12, 'foto',  E'uploads\\denuncias\\12\\1749596535_339a232ee4887b02f2f3.png')